[
  {
    "title": "Whispers of the Veil — Part 1: The Calling Storywriting By Faisal Ansari",
    "description": "It was a humid afternoon in June 2020 — a day that Faisal Rehman, an ordinary college student \r\nat the Government Degree College for Boys, Nawabshah, began like any other. Half-heartedly \r\nattending classes, half of which he bunked as usual, Faisal spent more time laughing with \r\nfriends and wandering through empty corridors than listening to lectures. By the time he pedaled \r\nhome on his rusty old bicycle, the day was already melting into the evening’s warmth. \r\nAs he entered his modest home, Faisal offered his salaam to everyone he passed — his \r\nsiblings, his mother, his grandfather and grandmother, even his aunt who lived with them. There \r\nwas comfort in this routine: familiar faces, predictable greetings, the smell of fresh roti wafting \r\nfrom the kitchen. \r\nWhen his father arrived home shortly after, Faisal greeted him too, expecting nothing more than \r\na gentle nod in return. But today, his father paused, smiled faintly and said, “Beta, there’s a Sufi \r\nZikr mehfil tonight. Come with me.” \r\nFaisal, who prided himself on being a rational, almost stubbornly logical boy, felt a flicker of \r\nhesitation. He had always kept a safe distance from what he considered emotional or ‘overly \r\nspiritual’ gatherings. In his mind, he was the sort who believed in facts, books, and discipline — \r\nnot men who danced themselves into ecstasy chanting ancient words. \r\nYet, that evening, without protest, he simply nodded and agreed. \r\nBy dusk, the city had cooled. Faisal found himself standing at the entrance of an old house, its \r\nlarge wooden doors open, inviting. Inside, the air hummed with low voices, the scent of burning \r\nincense curling in lazy spirals towards the dimly lit ceiling. \r\nDozens of men sat cross-legged on simple rugs. At the center of this gathering, Faisal’s gaze \r\nwas drawn — almost pulled — to one man in white. The man wore a plain white shalwar \r\nkameez, a white kufi cap wrapped with a light cloth that rested gently on his head. There was \r\nsomething unsettling yet calming about his presence; his face seemed to glow in the flickering \r\ncandlelight. \r\nWho are these people? Faisal thought to himself, an edge of annoyance creeping in. What \r\nstrange company has father dragged me into? \r\nAlmost as if he had spoken the words aloud, the luminous man turned, locked eyes with Faisal, \r\nand stood. Before Faisal could react, the man came forward, embraced him gently, and \r\nwhispered so close to his ear that Faisal felt the warmth of his breath: \r\n\"Do not be afraid… you are exactly where you were meant to be.\" \r\nFaisal’s heart thudded in his chest. His arms froze mid-embrace. A chill spread through him — \r\nnot of fear, but of a sudden, unfamiliar calm that made him shiver even in the warm hall. \r\nThe zikr began. The gathering swayed and murmured the timeless declaration: “La Ilaha Illallah \r\nMuhammadur RasoolAllah…” — voices blending into a hypnotic tide. Soon, musicians tuned a \r\nyaktara, harmonium, and dholak. Classical singers joined in, their raw, earthy voices filling the \r\nroom with verses of divine longing. \r\nTo Faisal, it seemed absurd. Songs? Drums? Swaying bodies? He watched in disbelief as the \r\nsame white-clad man and a few others rose and began to spin and move to the rhythm — a \r\ndance that seemed both chaotic and deeply rooted in some ancient sorrow he couldn’t grasp. \r\nHow can they speak of God and then dance like this? Faisal’s mind rebelled. Is this worship or \r\nmadness? \r\nWhen the session ended, the man in white — Sarfaraz Ahmed, as he would learn — sat before \r\nthe gathering and spoke in a calm voice that silenced every whisper. \r\n\"Hatred is everywhere in this world,\" Sarfaraz said. \"And if you look closely, you’ll see it hides \r\nmost easily behind religion. Yet, the same religion speaks of love more than anything else. If we \r\nwish to love, we must learn to see beyond religion — and forget hate altogether.\" \r\nFaisal sat still, listening, yet questions burned inside him. What about the songs, the dance? \r\nIsn’t that forbidden? \r\nSarfaraz turned to him, as if reading his silent protest. His eyes were kind but sharp. “Outwardly, \r\nyes — songs and dance are worldly, even forbidden when they serve the ego. But when the \r\nName of the One is uttered, when the purpose is love and remembrance, then what was once \r\nforbidden finds permission.” \r\nHe paused, leaning forward just enough for Faisal to hear his words clearly. “A cow is not halal \r\nuntil Allah’s Name is spoken over it. Yet the One who gives life is the One who takes it — so \r\nwhat changes? Only the Name. The Name transforms the forbidden into the blessed.” \r\nFor the first time that night, Faisal felt his rigid mind soften. His chest loosened. Something \r\nburied deep inside him stirred — a question not of logic, but of belonging. \r\nThat night, Faisal slept deeper than he had in months. In his dreams, he saw a figure radiant \r\nwith light — Mola Ali (A.S.), the lion of God. Mola Ali embraced him as a father would embrace a \r\nlong-lost child. \r\n\"You are not ordinary, my son,\" Mola Ali said, voice echoing in the chambers of Faisal’s sleeping \r\nmind. \"You are chosen by us — a helper to many, a bearer of compassion. Walk this path \r\nwithout fear.\" \r\nIn that moment, dream and reality blurred. Zikr began in his dream. He felt his lips move, \r\nrepeating ancient words with Mola Ali by his side. \r\nWhen Faisal woke, the morning sun slipped through the cracks in his window. His heart was \r\ncalm, his eyes moist. He fell into a sajda of gratitude, tears dampening the prayer mat beneath \r\nhis forehead. \r\nWithout waiting for breakfast, Faisal rushed to find Sarfaraz Ahmed. When he told him every \r\ndetail of the dream, Sarfaraz simply smiled, a deep knowing shining behind his gentle eyes. \r\n\"Congratulations,\" Sarfaraz said, laying a hand on Faisal’s shoulder. \"You have been marked by \r\nthe lion himself. Your path will unfold soon. The world will see what you are meant to become.\" \r\nFaisal, though filled with new hope, still wondered quietly: How could this be? What could I ever \r\nbecome? \r\nSarfaraz answered his unspoken thought, his voice low but certain. “You will know… soon \r\nenough.” \r\n\r\nTo be continued… \r\n✨\r\n\r\n End of Part 1",
    "image": "uploads/blogs/images//preparation-ramadan-tradition_23-2151925292.jpg",
    "video": "",
    "timestamp": "2025-07-09 16:09:25"
  },
  {
    "id": "20250709173148",
    "title": "How I Started My Journey in Web Development",
    "description": "It all began with a simple curiosity—how do websites work? I remember inspecting the source code of my favorite pages and being amazed by how HTML, CSS, and JavaScript came together.\r\nEventually, I discovered Flask and Python, and everything changed. Creating dynamic pages, handling forms, and managing data gave me the power to build real applications.\r\nToday, I'm working on my personal portfolio, managing blog posts, and continuously learning.\r\nThis journey isn't over—it's just getting started. 🚀\r\n\r\n— Faisal Rehman Ansari",
    "image": "",
    "video": "",
    "timestamp": "2025-07-09 17:31:48"
  }
]